Revit 2027 API
IDuplicateTypeNamesHandler.OnDuplicateTypeNamesFound Method
 Called when the destination document contains types with the same names as the types being copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
DuplicateTypeAction OnDuplicateTypeNamesFound(
	DuplicateTypeNamesHandlerArgs args
)
Function OnDuplicateTypeNamesFound (
	args As DuplicateTypeNamesHandlerArgs
) As DuplicateTypeAction
DuplicateTypeAction OnDuplicateTypeNamesFound(
	DuplicateTypeNamesHandlerArgs^ args
)
abstract OnDuplicateTypeNamesFound :
        args : DuplicateTypeNamesHandlerArgs -> DuplicateTypeAction
Parameters
args DuplicateTypeNamesHandlerArgs
 The information about the types with duplicate names.
Return Value
DuplicateTypeAction
 The action to be taken: copy only types with unique names or cancel the operation.
See Also
Reference
IDuplicateTypeNamesHandler Interface
Autodesk.Revit.DB Namespace